![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/images/IDSNlogo.png)

# Hands-on Lab : Sub-queries and Nested SELECTs

**Estimated time needed**: 20 minutes

In this lab, you will run through some SQL practice problems that will provide hands-on experience with nested SQL SELECT statements (also known as Sub-queries).


**How does a typical Nested SELECT statement syntax look?**

```sql
SELECT column_name [, column_name ]
FROM table1 [, table2 ]
WHERE column_name OPERATOR
   (SELECT column_name [, column_name ]
   FROM table1 [, table2 ]
   WHERE condition);
```

## Software Used in this Lab

In this lab, you will use an [IBM Db2 Database](https://www.ibm.com/products/db2-database?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01). Db2 is a Relational Database Management System (RDBMS) from IBM, designed to store, analyze and retrieve data efficiently.

To complete this lab you will utilize a Db2 database service on IBM Cloud. If you did not already complete this lab task earlier in this module, you will not yet have access to Db2 on IBM Cloud, and you will need to follow the lab below first:

- [Hands-on Lab : Sign up for IBM Cloud, Create Db2 service instance and Get started with the Db2 console](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html)

## Database Used in this Lab

The database used in this lab is an internal database. You will be working on a sample HR database. This HR database schema consists of 5 tables called **EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS** and **LOCATIONS**. Each table has a few rows of sample data. The following diagram shows the tables for the HR database:

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/images/HR_Database.PNG)

**NOTE**: This lab requires you to have all 5 of these tables of the HR database populated with sample data on Db2. If you didn't complete the earlier lab in this module, you won't have the tables above populated with sample data on Db2, so you will need to go through the lab below first:

- Hands-on Lab : Create tables using SQL scripts and Load data into tables

## Objectives

After completing this lab you will be able to:

- Write SQL queries that demonstrate the necessity of using sub-queries
- Compose sub-queries in the where clause
- Build Column Expressions (i.e. sub-query in place of a column)
- Write Table Expressions (i.e. sub-query in place of a table)

## NOTE : Make sure that you are using the CSV file and datasets from the same instruction file.

## Instructions

When you approach the exercises in this lab, follow the instructions to run the queries on Db2:

- Go to the [Resource List](https://cloud.ibm.com/resources?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01) of IBM Cloud by logging in where you can find the Db2 service instance that you created in a previous lab under **Services** section. Click on the **Db2-xx service**. Next, open the Db2 Console by clicking on **Open Console** button. Click on the 3-bar menu icon in the top left corner and go to the **Run SQL** page. The Run SQL tool enables you to run SQL statements.

    - If needed, follow [Hands-on Lab : Sign up for IBM Cloud, Create Db2 service instance and Get started with the Db2 console](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sign%20up%20for%20IBM%20Cloud%20-%20Create%20Db2%20service%20instance%20-%20Get%20started%20with%20the%20Db2%20console/instructional-labs.md.html)

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect('data/database.db')
cur = con.cursor()

## Exercise:

1. Problem:

    *Execute a failing query (i.e. one which gives an error) to retrieve all employees records whose salary is lower than the average salary.*

<details>
	<summary>Click here for Hint</summary>

Use the AVG aggregate function.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
select * 
from employees 
where salary < AVG(salary);
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/images/1.png)

</details>

In [4]:
query = '''
            SELECT *
            FROM EMPLOYEES
            WHERE SALARY < AVG(SALARY)
        '''
df = pd.read_sql_query(query, con)
df

DatabaseError: Execution failed on sql '
            SELECT *
            FROM EMPLOYEES
            WHERE SALARY < AVG(SALARY)
        ': misuse of aggregate function AVG()

2. Problem:

    *Execute a working query using a sub-select to retrieve all employees records whose salary is lower than the average salary.*

<details>
	<summary>Click here for Hint</summary>

Put AVG(SALARY) of the inner SELECT in comparison with SALARY of the outer SELECT.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
select EMP_ID, F_NAME, L_NAME, SALARY 
from employees 
where SALARY < (select AVG(SALARY) 
                from employees);
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/images/2.png)

</details>

In [5]:
query = '''
            SELECT *
            FROM EMPLOYEES
            WHERE SALARY < (SELECT AVG(SALARY)
                            FROM EMPLOYEES)
        '''
df = pd.read_sql_query(query, con)
df

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1003,Steve,Wells,123458,08/10/1980,M,"291 Springs, Gary,IL",300,50000,30002,5
1,E1004,Santosh,Kumar,123459,07/20/1985,M,"511 Aurora Av, Aurora,IL",400,60000,30004,5
2,E1005,Ahmed,Hussain,123410,01/04/1981,M,"216 Oak Tree, Geneva,IL",500,70000,30001,2
3,E1007,Mary,Thomas,123412,05/05/1975,F,"100 Rose Pl, Gary,IL",650,65000,30003,7
4,E1008,Bharath,Gupta,123413,05/06/1985,M,"145 Berry Ln, Naperville,IL",660,65000,30003,7
5,E1009,Andrea,Jones,123414,07/09/1990,F,"120 Fall Creek, Gary,IL",234,70000,30003,7
6,E1010,Ann,Jacob,123415,03/30/1982,F,"111 Britany Springs,Elgin,IL",220,70000,30004,5

3. Problem:

    *Execute a failing query (i.e. one which gives an error) to retrieve all employees records with EMP_ID, SALARY and maximum salary as MAX_SALARY in every row.*

<details>
	<summary>Click here for Hint</summary>

Use the MAX aggregate function.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
select EMP_ID, SALARY, MAX(SALARY) AS MAX_SALARY 
from employees;	
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/images/3.png)

</details>

In [6]:
query = '''
            SELECT EMP_ID, SALARY, MAX(SALARY) AS MAX_SALARY
            FROM EMPLOYEES
        '''
df = pd.read_sql_query(query, con)
df

  EMP_ID  SALARY  MAX_SALARY
0  E1001  100000      100000

4. Problem:

    *Execute a Column Expression that retrieves all employees records with EMP_ID, SALARY and maximum salary as MAX_SALARY in every row.*

<details>
	<summary>Click here for Hint</summary>

Use the SELECT (which retrieves MAX(SALARY)) as a column of the other SELECT.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
select EMP_ID, SALARY, ( select MAX(SALARY) from employees ) AS MAX_SALARY 
from employees;
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/images/4.png)

</details>

In [7]:
query = '''
            SELECT EMP_ID, SALARY, (SELECT MAX(SALARY) FROM EMPLOYEES) AS MAX_SALARY
            FROM EMPLOYEES
        '''
df = pd.read_sql_query(query, con)
df

  EMP_ID  SALARY  MAX_SALARY
0  E1001  100000      100000
1  E1002   80000      100000
2  E1003   50000      100000
3  E1004   60000      100000
4  E1005   70000      100000
5  E1006   90000      100000
6  E1007   65000      100000
7  E1008   65000      100000
8  E1009   70000      100000
9  E1010   70000      100000

5. Problem:

    *Execute a Table Expression for the EMPLOYEES table that excludes columns with sensitive employee data (i.e. does not include columns: SSN, B_DATE, SEX, ADDRESS, SALARY).*

<details>
	<summary>Click here for Hint</summary>

Use a SELECT (which retrieves non-sensitive employee data) after FROM of the other SELECT.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
select * from ( select EMP_ID, F_NAME, L_NAME, DEP_ID from employees) AS EMP4ALL;
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/images/5.png)

</details>

In [8]:
query = '''
            SELECT *
            FROM (SELECT EMP_ID, F_NAME, L_NAME, DEP_ID FROM EMPLOYEES);
        '''
df = pd.read_sql_query(query, con)
df

  EMP_ID   F_NAME   L_NAME DEP_ID
0  E1001     John   Thomas      2
1  E1002    Alice    James      5
2  E1003    Steve    Wells      5
3  E1004  Santosh    Kumar      5
4  E1005    Ahmed  Hussain      2
5  E1006    Nancy    Allen      2
6  E1007     Mary   Thomas      7
7  E1008  Bharath    Gupta      7
8  E1009   Andrea    Jones      7
9  E1010      Ann    Jacob      5

## Solution Script

If you would like to run all the solution queries of the SQL problems in this lab with a script, download the script below. Upload the script to the Db2 console and run it. Follow [Hands-on Lab : Create tables using SQL scripts and Load data into tables](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Create%20tables%20using%20SQL%20scripts%20and%20Load%20data%20into%20tables/instructional-labs.md.html) on how to upload a script to Db2 console and run it.

- [SubQueries_Solution_Script.sql](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/SubQueries_Solution_Script.sql)

### Congratulations! You have completed this lab, and you are ready for the next topic.

In [9]:
con.close()

## Author(s)

- [Rav Ahuja](https://www.linkedin.com/in/ravahuja/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01)
- [Sandip Saha Joy](https://www.linkedin.com/in/sandipsahajoy/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01)

## Other Contributor(s)

-

## Changelog

| Date              | Version | Changed By          | Change Description                    |
| ----------------- | ------- | ------------------- | ------------------------------------- |
| 2020-12-25        | 2.1     | Steve Ryan          | ID Reviewed                           |
| 2020-12-10        | 2.0     | Sandip Saha Joy     | Created revised version from DB0201EN |
| 2020              | 1.0     | Rav Ahuja           | Created initial version               |

## <h3 align="center"> © IBM Corporation 2020. All rights reserved. <h3/>